       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULAR-AREA.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 NUMEROS.
          05 BASE-RECT   PIC 9(3) VALUE 0.
          05 ALTURA-RECT PIC 9(3) VALUE 0.
          05 RESULTADO   PIC 9(6) VALUE 0.

       PROCEDURE DIVISION.
       001-INICIO.
           DISPLAY "INTRODUCE LA BASE (3 DIGITOS): ".
           ACCEPT BASE-RECT.

           DISPLAY "INTRODUCE LA ALTURA (3 DIGITOS): ".
           ACCEPT ALTURA-RECT.

           MULTIPLY BASE-RECT BY ALTURA-RECT GIVING RESULTADO.

           DISPLAY "EL AREA TOTAL ES: " RESULTADO.

           STOP RUN.